fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Сообщить("Создать на основании");
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда

        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";

		Возврат КомандаСоздатьНаОсновании;

	КонецЕсли;

	Возврат Неопределено;

КонецФункции
//++ Кравченко С.Ю. 22.09.2026

// // Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Акт";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
	КомандаПечати.Порядок = 5;


КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Акт");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАкта(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказании услуг'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанииУслуг";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Акт";

	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_АктОбОказанииУслуг");

	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);

	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл

		ВыборкаТовары = ДанныеДокументов.Товары.Выбрать();
		ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();

		Если ВыборкаТовары.Количество() = 0 И ВыборкаУслуги.Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон("В документе %1 не заполнены товары и услуги.", ДанныеДокументов.Ссылка);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.УстановитьДанные(ДанныеДокументов.Ссылка);
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ВывестиЗаголовок(ДанныеДокументов, ТабличныйДокумент, Макет);
		ВывестиРеквизитыСторон(ДанныеДокументов, ТабличныйДокумент, Макет);
		ВывестиТаблицы(ДанныеДокументов, ТабличныйДокумент, Макет);
		ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

Функция ПолучитьДанныеДокументов(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Наименование КАК НоменклатураНаименование,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Товары,
	|	РеализацияТоваровУслуг.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Наименование КАК НоменклатураНаименование,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Услуги,
	|	РеализацияТоваровУслуг.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&МассивОбъектов)";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Процедура ВывестиЗаголовок(ДанныеДокументов, ТабличныйДокумент, Макет)

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.Дата = Формат(ДанныеДокументов.Дата, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);

КонецПроцедуры

Процедура ВывестиРеквизитыСторон(ДанныеДокументов, ТабличныйДокумент, Макет)

	Область = Макет.ПолучитьОбласть("Общая");
	Область.Параметры.Контрагент = ДанныеДокументов.Контрагент;
	Область.Параметры.Организация = ДанныеДокументов.Организация;
	Область.Параметры.Договор = ДанныеДокументов.Договор;

	ТабличныйДокумент.Вывести(Область);

КонецПроцедуры

Процедура ВывестиТаблицы(ДанныеДокументов, ТабличныйДокумент, Макет)

	ВыборкаТовары = ДанныеДокументов.Товары.Выбрать();
	Если ВыборкаТовары.Количество() > 0 Тогда

		ОбластьШапкаТовары = Макет.ПолучитьОбласть("ШапкаТаблицыТовары");
		ОбластьСтрокаТовары = Макет.ПолучитьОбласть("СтрокаТовары");
		ОбластьИтогоТовары = Макет.ПолучитьОбласть("ИтогоТовары");

		ТабличныйДокумент.Вывести(ОбластьШапкаТовары);

		СуммаТовары = 0;
		НомерСтроки = 0;
		Пока ВыборкаТовары.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			ДанныеСтроки = Новый Структура;
			ДанныеСтроки.Вставить("НомерСтроки", НомерСтроки);
			ДанныеСтроки.Вставить("Номенклатура", ВыборкаТовары.НоменклатураНаименование);
			ДанныеСтроки.Вставить("Количество", ВыборкаТовары.Количество);
			ДанныеСтроки.Вставить("Цена", ВыборкаТовары.Цена);
			ДанныеСтроки.Вставить("Сумма", ВыборкаТовары.Сумма);
			ОбластьСтрокаТовары.Параметры.Заполнить(ДанныеСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТовары);
			СуммаТовары = СуммаТовары + ВыборкаТовары.Сумма;
		КонецЦикла;

		ДанныеИтога = Новый Структура;
		ДанныеИтога.Вставить("Всего", СуммаТовары);
		ДанныеИтога.Вставить("ИтоговаяСуммаПрописью",ЧислоПрописью(СуммаТовары, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
		ОбластьИтогоТовары.Параметры.Заполнить(ДанныеИтога);
		ТабличныйДокумент.Вывести(ОбластьИтогоТовары);

	КонецЕсли;

	ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
	Если ВыборкаУслуги.Количество() > 0 Тогда

		ОбластьШапкаУслуги = Макет.ПолучитьОбласть("ШапкаТаблицыУслуги");
		ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
		ОбластьИтогоУслуги = Макет.ПолучитьОбласть("ИтогоУслуги");

		ТабличныйДокумент.Вывести(ОбластьШапкаУслуги);

		СуммаУслуги = 0;
		НомерСтроки = 0;
		Пока ВыборкаУслуги.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			ДанныеСтроки = Новый Структура;
			ДанныеСтроки.Вставить("НомерСтроки", НомерСтроки);
			ДанныеСтроки.Вставить("Номенклатура", ВыборкаУслуги.НоменклатураНаименование);
			ДанныеСтроки.Вставить("Количество", ВыборкаУслуги.Количество);
			ДанныеСтроки.Вставить("Цена", ВыборкаУслуги.Цена);
			ДанныеСтроки.Вставить("Сумма", ВыборкаУслуги.Сумма);
			ОбластьСтрокаУслуги.Параметры.Заполнить(ДанныеСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрокаУслуги);
			СуммаУслуги = СуммаУслуги + ВыборкаУслуги.Сумма;
		КонецЦикла;

		ДанныеИтога = Новый Структура;
		ДанныеИтога.Вставить("Всего", СуммаУслуги);
		ДанныеИтога.Вставить("ИтоговаяСуммаПрописью",ЧислоПрописью(СуммаУслуги, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));		
		ОбластьИтогоУслуги.Параметры.Заполнить(ДанныеИтога);
		ТабличныйДокумент.Вывести(ОбластьИтогоУслуги);

	КонецЕсли;

КонецПроцедуры

Процедура ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет)

	ОбластьИтог = Макет.ПолучитьОбласть("ИтогоПодвал");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");

	СуммаПрописью = ЧислоПрописью(ДанныеДокументов.СуммаДокумента, ,
		"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");

	ДанныеПрописи = Новый Структура;
	ДанныеПрописи.Вставить("ИтоговаяСуммаПрописью", СтрШаблон("На сумму: %1", СуммаПрописью));
	ДанныеПрописи.Вставить("ИтогоКОплате", ДанныеДокументов.СуммаДокумента);
	ОбластьИтог.Параметры.Заполнить(ДанныеПрописи);
	ТабличныйДокумент.Вывести(ОбластьИтог);

	ОбластьПодписи.Параметры.ФИОИсполнителя = ДанныеДокументов.Ответственный;
	ТабличныйДокумент.Вывести(ОбластьПодписи);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
